app/controllers/containers_controller.rb

SELECT * FROM "containers"
---
  def index
    @containers = Container.all

SELECT * FROM "containers" WHERE ("containers"."id" = 1)
---
  def show
    @container = Container.find(params[:id])

INSERT INTO "containers" ("label", "containertype_id", "comment", "created_at", "updated_at", "given_on", "mediatype_id", "gave_to", "given") VALUES('asd', NULL, '123', '2010-02-14 05:10:12', '2010-02-14 05:10:12', NULL, NULL, NULL, NULL)
---
  def create
    @container = Container.new(params[:container])
    if @container.save

SELECT * FROM "containers" WHERE ("containers"."id" = 1)
DELETE FROM "containers" WHERE "id" = 1
---
  def destroy
    @container = Container.find(params[:id])
    @container.destroy